"""
Представьте, что сумма за пользование услугами такси складывается из
базового тарифа в размере $4,00 плюс $0,25 за каждые 140 м поездки.
Напишите функцию, принимающую в качестве единственного параметра
расстояние поездки в километрах и возвращающую итоговую сумму опла-
ты такси.
"""


def taxi(dlina):
    if dlina <= 140:
        return 4.25
    else:
        return taxi(dlina - 140) + 0.25


print(taxi(50))
