"""Создайте словарь с количеством элементов не менее 5-ти.
Поменяйте местами первый и последний элемент объекта.
Удалите второй элемент. Добавьте в конец ключ «new_key» со значением «new_value».
Выведите на печать итоговый словарь. Важно, чтобы словарь остался тем же (имел тот же адрес в памяти).
"""
bebebe = {1: 'kiss ', 2: 'my ', 3: 'ass ', 4: ', ', 5: 'goodbye'}

buffer = bebebe[1]
bebebe[1] = bebebe[5]
bebebe[5] = buffer

del bebebe[2]

bebebe['new_key'] = 'new_value'

print(bebebe)