"""
Напишите программу принимающую ввод информации о треке(место в чарте,исполнитель, название) пока пользователь
не введет "off". Программа должна вывести всю информацию в виде словаря вида: {(место,испонитель): название трека}
"""
music = {}
i = input()
while i != 'off':
    info = i.split(', ')
    music[tuple(info[:2])] = info[2:]
    i = input()
print(music)


