"""
Напишите программу считающую и обрабатывающую индекс массы тела.
В одной функции программа должна считать ИМТ. В другой обрабатывать, если ИМТ ниже 18.5 печатать "Недостаточный вес",
от 18.5 до 25 "ИМТ в норме", больше 25 "Избыточный вес".
Формула определения ИМТ: index = weight / (height * height)
"""
def imt(w, h):
    ind = w/(h * h)
    return ind


def norm_imt(w, h):
    i = imt(w, h)
    if i < 18.5:
        print('Недостаточный вес')
    elif i < 25:
        print('ИМТ в норме')
    else:
        print('Избыточный вес')


norm_imt(int(input('Вес: ')), float(input('Рост в метрах: ')))
